[
  {
    "heroBanner": "./assets/pushpa.jpg",
    "title": ["Title : Pushpa", "Release Date : December 6, 2024","Language: Telugu","Type: Movie","Runtime : 3hr 21m","StoryLine : "],
    "titleImage": "./assets/pushpa_title.png",
    "description": "Pushpa is become the head of red sandal smuggling syndicate and rules the whole state. While Bhawar Singh Shekhawat is waiting for revenge on Pushpa for insulting him.",
    "videoUrl": "https://www.youtube.com/watch?v=g3JUbgOHgdw&t=2s",
    "moreInfo":" Pushpa is become the head of red sandal smuggling syndicate and rules the whole state .While Bhawar Singh Shekhawat is waiting for revenge on Pushpa for insulting him. Pushpa happily married to Srivalli and can do anything for her,she asks for a picture with state Chief Minister during his meet but the CM rejects it considering it might harm his reputation for clicking with smuggler.Pushpa convinces his friend Sidappa to contestant the upcoming elections of next CM and he is ready spend heavy amount for the same.Pushpa teams with an international smuggler Hameed for a huge consignment of Red Sandal and alerts all his dealers.Shekawat takes this opportunity to get Pushpa on his knees by teaming up with Sinu and Daksha."
  },
  {
    "heroBanner": "./assets/solo (2).jpg",
    "title":["Title : Solo Leveling", "Release Date : January 6, 2024","Language: Japanese","Type: Anime Series","Runtime : Episodes [24m]","StoryLine : "],
    "titleImage": "./assets/solot.jpg",
    "description": "Follows the adventures of Sung Jinwoo in a world that is constantly threatened by monsters and evil forces. In his battles Sung transforms himself from the weakest hunter of all mankind to one of the strongest hunters in existence.",
    "videoUrl": "https://www.youtube.com/watch?v=LVDIsrTI6Kg",
    "moreInfo":" In a world where hunters, humans who possess magical abilities, must battle deadly monsters to protect the human race from certain annihilation, a notoriously weak hunter named Sung Jinwoo finds himself in a seemingly endless struggle for survival. One day, after narrowly surviving an overwhelmingly powerful double dungeon that nearly wipes out his entire party, a mysterious program called the System chooses him as its sole player and in turn, gives him the extremely rare ability to level up in strength, possibly beyond any known limits. Jinwoo then sets out on a journey as he fights against all kinds of enemies, both man and monster, to discover the secrets of the dungeons and the true source of his powers."
  },
  {
    "heroBanner": "./assets/arcane.jpeg",
    "title":["Title : Arcane", "Release Date : November 7, 2021","Language: English","Type: Tv Series","Runtime : Episodes[30m-50m]","StoryLine : "],
    "titleImage": "./assets/arcanet.png",
    "description": "Amid the stark discord of twin cities Piltover and Zaun, two sisters fight on rival sides of a war between magic technologies and clashing convictions.",
    "videoUrl": "https://www.youtube.com/watch?v=hsffPST-x1k&t",
    "moreInfo":" The delicate balance between the rich city of Piltover and the seedy underbelly of Zaun. Tensions between these city-states boil over with the creation of 'hextech', a way for any person to control magical energy in Piltover, and in Zaun, a new drug called 'shimmer' transforms humans into monsters. The rivalry between the cities splits families and friends as Arcane brings life to the relationships that shape some of League of Legends' famous champions including Vi, Jinx, Caitlyn, Jayce, Viktor, and Ekko."
  },
  {
    "heroBanner": "./assets/gk.jpg",
    "title":["Title : Godzilla x Kong: The New Empire", "Release Date : March 29, 2024","Language: English","Type: Movie","Runtime : 1hr 55m","StoryLine : "],
    "titleImage": "./assets/gkt.jpg",
    "description": "Two ancient titans, Godzilla and Kong, clash in an epic battle as humans unravel their intertwined origins and connection to Skull Island's mysteries.",
    "videoUrl": "https://www.youtube.com/watch?v=qqrpMRDuPfc",
    "moreInfo":" The new installment in the Monsterverse puts the mighty Kong and the fearsome Godzilla against a colossal deadly threat hidden within our world that threatens the existence of their species and our very own, as well as diving deep into the mysteries of Skull Island and beyond. Delving straight into the origins of Hollow Earth, this film will explore the ancient Titan battle that brought man and monster together forever."
  },
  {
    "heroBanner": "./assets/dw1.jpg",
    "title":["Title : Deadpool & Wolverine", "Release Date : July 25, 2024","Language: English","Type: Movie","Runtime : 2hr 08m","StoryLine : "],
    "titleImage": "./assets/dwt.png",
    "description": "Deadpool is offered a place in the Marvel Cinematic Universe by the Time Variance Authority, but instead recruits a variant of Wolverine to save his universe from extinction.",
    "videoUrl": "https://www.youtube.com/watch?v=73_1biulkYk",
    "moreInfo":" In this multiverse story Deadpool is approached by a man named Paradox who intends on vaporizing his entire universe because apparently it's not supposed to go on living without the now deceased hero Wolverine. Deadpool kidnaps another version of Wolverine to replace but this only results in Paradox banishing both Deadpool and Wolverine."
  },
  {
    "heroBanner": "./assets/kalki.jpeg",
    "title":["Title : Kalki 2898-AD", "Release Date : June 27, 2024","Language: Telugu","Type: Movie","Runtime : 3hr 02m","StoryLine : "],
    "titleImage": "./assets/kalikit.jpg",
    "description": "The future of those in the dystopian city of Kasi is altered when the destined arrival of Lord Vishnu's final avatar launches a war against darkness.",
    "videoUrl": "https://youtu.be/y1-w1kUGuz8?si=_3yizjckHRdBG9Pt&t=7",
    "moreInfo":" During the Kurukshetra war Ashwatthama is cursed by lord Krishna to attain immortality and witness humanity during Kalyug.His redemption can occur by protecting mother of Kalki the last reincarnation of Lord Vishnu. Six thousand years later in the futuristic world deserted city of Kasi is ruled by an evil Yaskin.His complex is run by Commander Manas whose team is working on Project K for Yaskin.They capture fertile women and their serum is used to increase life of Yaskin but hardly any female survive beyond 120 days of fertility.Sum 80 (Sumati) suppresses 150 days and is about to meet the same faith as others.But manages to elope with help of few rebels,Ashwatthama realizes that Sumati is the woman he is there to protect and comes to her aid.Yaskin and Manas are desperate to find Sumati but Ashwatthama stands between them. A confusion arises when Bhairav comes to save Sumati where he and Ashwatthama clash mistaken themselves as either to be enemy of Sumati."
  },
  {
    "heroBanner": "./assets/sime.jpg",
    "title":["Title : Smile 2", "Release Date : October 18, 2024","Language: English","Type: Movie","Runtime : 2hr 07m","StoryLine : "],
    "titleImage": "./assets/simlet.png",
    "description": "About to embark on a world tour, global pop sensation Skye Riley begins experiencing increasingly terrifying and inexplicable events. Overwhelmed by the escalating horrors and the pressures.",
    "videoUrl": "https://www.youtube.com/watch?v=f8ehWvUjo3U",
    "moreInfo":" About to embark on a new world tour, global pop sensation Skye Riley (Naomi Scott) begins experiencing increasingly terrifying and inexplicable events. Overwhelmed by the escalating horrors and the pressures of fame, Skye is forced to face her dark past to regain control of her life before it spirals out of control."
  },
  {
    "heroBanner": "./assets/ze.jpg",
    "title": ["Title : Demon Slayer: Kimetsu no Yaiba", "Release Date : April 6, 2019","Language: Japanese","Type: Anime Series","Runtime : Episodes [24m]","StoryLine : "],
    "titleImage": "./assets/zet.jpg",
    "description": "A family is attacked by demons and only two members survive - Tanjiro and his sister Nezuko, who is turning into a demon slowly. Tanjiro sets out to become a demon slayer to avenge his family and cure his sister.",
    "videoUrl": "https://www.youtube.com/watch?v=6utnO6bdKJY",
    "moreInfo":" A family is attacked by demons and only two members survive - Tanjiro and his sister Nezuko, who is turning into a demon slowly. Tanjiro sets out to become a demon slayer to avenge his family and cure his sister."
  },
  {
    "heroBanner": "./assets/wed.jpg",
    "title": ["Title : Wednesday", "Release Date : November 23, 2022","Language: English","Type: Tv Series","Runtime : Episodes [45m]","StoryLine : "],
    "titleImage": "./assets/wedt.png",
    "description": "Follows Wednesday Addams' years as a student, when she attempts to master her emerging psychic ability, thwart a killing spree, and solve the mystery that embroiled her parents.",
    "videoUrl": "https://www.youtube.com/watch?v=NakTu_VZxJ0",
    "moreInfo":" A sleuthing, supernaturally infused mystery charting Wednesday Addams' years as a student at Nevermore Academy. Wednesday's attempts to master her emerging psychic ability, thwart a monstrous killing spree that has terrorized the local town, and solve the supernatural mystery that embroiled her parents 25 years ago - all while navigating her new and very tangled relationships at Nevermore."
  },
  {
    "heroBanner": "./assets/groot.jpg",
    "title": ["Title : I Am Groot", "Release Date : August 10, 2022","Language: English","Type: Tv Series","Runtime : Episodes [4m]","StoryLine : "],
    "titleImage": "./assets/groott.png",
    "description": "A series of shorts featuring the seedling Groot along with several new and unusual characters.",
    "videoUrl": "https://www.youtube.com/watch?v=x9Jwd3E5Us4",
    "moreInfo":"A series of shorts featuring the seedling Groot along with several new and unusual characters.."
  },
  {
    "heroBanner": "./assets/loki.jpg",
    "title": ["Title : Loki", "Release Date : June 09, 2021","Language: English","Type: Tv Series","Runtime : Episodes [50m]","StoryLine : "],
    "titleImage": "./assets/lokit.png",
    "description": "The mercurial villain Loki resumes his role as the God of Mischief in a new series that takes place after the events of “Avengers: Endgame.”",
    "videoUrl": "https://www.youtube.com/watch?v=aPQ7YQ-vIPU",
    "moreInfo":" When an alternate Loki uses the Tesseract to escape in 'Avengers: Endgame,' the Time Variance Authority (TVA), a group that keeps an eye on the sacred timeline, captures him. After first doubting the TVA's legitimacy, Loki is forced to decide between being eliminated from the universe and assisting them in their search for a hazardous time variant-a different version of himself going by the name Sylvie. Along the way, they discover the secrets of the TVA and travel across time, forcing Loki to wrestle with issues of free will and identity and make a decision that could destroy the sacred timeline and unleash havoc over the multiverse."
  },
  {
    "heroBanner": "./assets/ava.jpg",
    "title": ["Title : Avatar", "Release Date : December 16, 2022","Language: English","Type: Movie","Runtime : 3hr 12m","StoryLine : "],
    "titleImage": "./assets/avat.png",
    "description": "ake Sully lives with his newfound family formed on the extrasolar moon Pandora. Once a familiar threat returns to finish what was previously started, Jake must work with Neytiri and the army of the Na'vi race to protect their home.",
    "videoUrl": "https://www.youtube.com/watch?v=a6VVrAZUnsc",
    "moreInfo":" Several years after the Na'vi repelled the RDA invasion Jake Sully and his family are living on Pandora. Things seem peaceful but the RDA has other plans, invading and capturing Pandora. Sully forms a guerrilla group to try to expel the invaders."
  },
  {
    "heroBanner": "./assets/dan.jpg",
    "title": ["Title : Dandadan", "Release Date : October 03, 2024","Language: Japanese","Type: Tv Series","Runtime : Episodes [24m]","StoryLine : "],
    "titleImage": "./assets/dant.png",
    "description": "When Momo and Okarun's beliefs clash, they're thrown into a world of ghosts, aliens and awakened powers.",
    "videoUrl": "https://www.youtube.com/watch?v=a4na2opArGY",
    "moreInfo":" When Momo and Okarun's beliefs clash, they're thrown into a world of ghosts, aliens and awakened powers.Dandadan can seem so unserious at first. What with its ridiculous foundations, its even weirder subplots, and its character dynamic, the range of the show feels so huge, which is why I haven't reviewed it before.While I know the show can go so many more places so easily, I have to say I think by now I can conclude: this show would struggle to go wrong. It is incredibly goo"
  },
  {
    "heroBanner": "./assets/st.jpg",
    "title": ["Title : Stranger Things", "Release Date : July 15, 2016","Language: English","Type: Tv Series","Runtime : Episodes [1hr]","StoryLine : "],
    "titleImage": "./assets/stt.png",
    "description": "In 1980s Indiana, a group of young friends witness supernatural forces and secret government exploits. As they search for answers, the children unravel a series of extraordinary mysteries.",
    "videoUrl": "https://www.youtube.com/watch?v=Wu_6ekD4SRc",
    "moreInfo":" In a small town where everyone knows everyone, a peculiar incident starts a chain of events that leads to a child's disappearance, which begins to tear at the fabric of an otherwise-peaceful community. Dark government agencies and seemingly malevolent supernatural forces converge on the town, while a few of the locals begin to understand that more is going on than meets the eye."
  },
  {
    "heroBanner": "./assets/hxh.jpg",
    "title": ["Title : Hunter x Hunter", "Release Date : August 01, 2014","Language: Japanese","Type: Tv Series","Runtime : Episodes [24m]","StoryLine : "],
    "titleImage": "./assets/hxht.png",
    "description": "Gon Freecss aspires to become a Hunter, an exceptional being capable of greatness. With his friends and his potential, he seeks out his father, who left him when he was younger.",
    "videoUrl": "https://www.youtube.com/watch?v=aO-ZaF4FJls",
    "moreInfo":" Gon Freecss is a young boy living on Whale Island. He learns from 'Hunter' Kite, that his father, who he was told was dead, is still alive somewhere as a top 'Hunter,' risking his life to seek unknown items, such as hidden treasures, curiosa, exotic living creatures, etc. Gon decides to become a professional Hunter and leaves the island. To become a Hunter, he must pass the Hunter Examination, where he meets and befriends three other applicants: Kurapika, Leorio and Killua. Can Gon pass this formidable hurdle, the Hunter Examination, to become 'the Best Hunter in the World' and eventually meet his father?."
  },
  {
    "heroBanner": "./assets/last.jpg",
    "title": ["Title : The Last of Us", "Release Date : January 16, 2023","Language: English","Type: Tv Series","Runtime : Episodes [50m]","StoryLine : "],
    "titleImage": "./assets/lastt.png",
    "description": "After a global pandemic destroys civilization, a hardened survivor takes charge of a 14-year-old girl who may be humanity's last hope.",
    "videoUrl": "https://www.youtube.com/watch?v=OUMbWkmKpqc",
    "moreInfo":" 20 years after modern civilization has been destroyed, Joel, a hardened survivor, is hired to smuggle Ellie, a 14-year-old girl, out of an oppressive quarantine zone. What starts as a small job soon becomes a brutal heartbreaking journey as they both must traverse the U.S. and depend on each other for survival."
  },
  {
    "heroBanner": "./assets/onep.jpg",
    "title": ["Title : One Piece", "Release Date : April 11, 2005","Language: Japanese","Type: Tv Series","Runtime : Episodes [24m]","StoryLine : "],
    "titleImage": "./assets/onept.png",
    "description": "Monkey D. Luffy sets off on an adventure with his pirate crew in hopes of finding the greatest treasure ever, known as the 'One Piece'.",
    "videoUrl": "https://www.youtube.com/watch?v=gt61WFQ-Uu0",
    "moreInfo":"There once lived a pirate named Gol D. Roger. He obtained wealth, fame, and power to earn the title of Pirate King. When he was captured and about to be executed, he revealed that his treasure called One Piece was hidden somewhere at the Grand Line. This made all people set out to search and uncover the One Piece treasure, but no one ever found the location of Gol D. Roger's treasure, and the Grand Line was too dangerous a place to overcome. Twenty-two years after Gol D. Roger's death, a boy named Monkey D. Luffy decided to become a pirate and search for Gol D. Roger's treasure to become the next Pirate King."
  },
  {
    "heroBanner": "./assets/wanda.jpg",
    "title": ["Title : Doctor Strange in the Multiverse of Madness", "Release Date : May 5, 2022","Language: English","Type: Movie","Runtime : 2hr 06m","StoryLine : "],
    "titleImage": "./assets/wandat.png",
    "description": "Doctor Strange teams up with a mysterious teenage girl who can travel across multiverses, to battle other-universe versions of himself which threaten to wipe out the multiverse.",
    "videoUrl": "https://www.youtube.com/watch?v=fSGpAQPtGoc",
    "moreInfo":"Following the events of Spider-Man No Way Home, Doctor Strange unwittingly casts a forbidden spell that accidentally opens up the multiverse. With help from Wong and Scarlet Witch, Strange confronts various versions of himself as well as teaming up with the young America Chavez while traveling through various realities and working to restore reality as he knows it. Along the way, Strange and his allies realize they must take on a powerful new adversary who seeks to take over the multiverse."
  },
  {
    "heroBanner": "./assets/jj.jpg",
    "title": ["Title : Jujutsu Kaisen", "Release Date : October 2, 2020","Language: Japanese","Type: Tv Series","Runtime : Episodes [24m]","StoryLine : "],
    "titleImage": "./assets/jjt.png",
    "description": "A boy swallows a cursed talisman - the finger of a demon - and becomes cursed himself. He enters a shaman's school to be able to locate the demon's other body parts and thus exorcise himself.",
    "videoUrl": "https://www.youtube.com/watch?v=NvcYfsSTzG4",
    "moreInfo":" Yuji Itadori, a kind-hearted teenager, joins his school's Occult Club for fun, but discovers that its members are actual sorcerers who can manipulate the energy between beings for their own use. He hears about a cursed talisman - the finger of Sukuna, a demon - and its being targeted by other cursed beings. Yuji eats the finger to protect his friends, and ends up becoming Sukuna's host. However, Yuji discovers that he has inherited magic and is able to control this power without interference from Sukuna. He joins the Tokyo Metropolitan Magic Technical College to consumes all of Sukuna's fingers, which will enable a full exorcism to take place that will free him."
  },
  {
    "heroBanner": "./assets/one.jpg",
    "title": ["Title : One Punch Man", "Release Date : April 1, 2018","Language: Japanese","Type: Tv Series","Runtime : Episodes [24m]","StoryLine : "],
    "titleImage": "./assets/onet.png",
    "description": "The story of Saitama, a hero that does it just for fun & can defeat his enemies with a single punch.",
    "videoUrl": "https://www.youtube.com/watch?v=_t17aSn1YJk",
    "moreInfo":" In a world of superhuman beings, Saitama is a unique hero, he can defeat enemies with a single punch. But being just one hero in a world filled with them, his life is empty and hollow: he gets no respect from anyone, he displays a laidback attitude to everything and for the most part, he finds his overall hero life pointless... and worst of all, he lost his hair due to intense training. These are the adventures of an ordinary yet extraordinary hero."
  },
  {
    "heroBanner": "./assets/sq.jpg",
    "title": ["Title : Squid Game", "Release Date : September 17, 2021","Language: Japanese","Type: Tv Series","Runtime : Episodes [1hr]","StoryLine : "],
    "titleImage": "./assets/sqt.png",
    "description": "Hundreds of cash-strapped players accept a strange invitation to compete in children's games. Inside, a tempting prize awaits with deadly high stakes: a survival game that has a whopping 45.6 billion-won prize at stake.",
    "videoUrl": "https://www.youtube.com/watch?v=hPMyxMyJr-0",
    "moreInfo":" A story of people who fail at life for various reasons, but suddenly receive a mysterious invitation to participate in a survival game to win more than 38 million US dollars. The game takes place on an isolated island and the participants are locked up until there is a final winner. The story incorporates popular Korean children's games from the 1970s and 1980s, such as squid game, the literal translation of its Korean name, which is a type of tag where offense and defense use a squid-shaped board drawn in the dirt.456 players are abducted from the streets of South Korea and crowded together on an island."
  },
  {
    "heroBanner": "./assets/chain.jpg",
    "title": ["Title : Chainsaw Man", "Release Date : October 25, 2022","Language: Japanese","Type: Tv Series","Runtime : Episodes [24m]","StoryLine : "],
    "titleImage": "./assets/chaint.png",
    "description": "Following a betrayal, a young man left for dead is reborn as a powerful devil-human hybrid after merging with his pet devil and is soon enlisted into an organization dedicated to hunting devils.",
    "videoUrl": "https://www.youtube.com/watch?v=TS71oR1C2WU",
    "moreInfo":" When his father died, Denji was stuck with a huge debt and no way to pay it back. Thanks to a Devil dog he saved named Pochita, he's able to survive through odd jobs, killing Devils for the Yakuza. Pochita's chainsaw powers come in handy against these powerful demons. When the Yakuza betrays him and he's killed by the Zombie Devil, Pochita sacrifices himself to save his former master. Now Denji is reborn as a Devil-Human hybrid. He is Chainsaw Man."
  },
  {
    "heroBanner": "./assets/cap.jpg",
    "title": ["Title : Captain America: Brave New World", "Release Date : February 14, 2025","Language: English","Type: Movie","Runtime : 1hr 58m","StoryLine : "],
    "titleImage": "./assets/capt.png",
    "description": "Sam Wilson, the new Captain America, finds himself in the middle of an international incident and must discover the motive behind a nefarious global plan.",
    "videoUrl": "https://www.youtube.com/watch?v=FEa9pPqGhPY",
    "moreInfo":" Some time after the events of The Falcon and the Winter Soldier, Sam Wilson has now fully embraced his title as the new Captain America. Now Sam is summoned to the White House as the new president Ross wants to work with him on rebuilding the Avengers. But trouble ensues when Sam's friend Isaiah Bradley uncontrollably tries to assassinate the president and is framed for the attempt. Now Sam and his partner Joaquin Torres must race against time to uncover the true culprit and foil an evil plot that unwittingly involves President Ross."
  },
  {
    "heroBanner": "./assets/got.jpg",
    "title": ["Title : Game of Thrones", "Release Date : April 18, 2011","Language: English","Type: Tv Series","Runtime : Episodes [1hr]","StoryLine : "],
    "titleImage": "./assets/gott.png",
    "description": "Nine noble families fight for control over the lands of Westeros, while an ancient enemy returns after being dormant for millennia.",
    "videoUrl": "https://youtu.be/JRmz4N6ao5o?si=huBj4JeEnI2aroGd&t=8",
    "moreInfo":" In the mythical continent of Westeros, several powerful families fight for control of the Seven Kingdoms. As conflict erupts in the kingdoms of men, an ancient enemy rises once again to threaten them all. Meanwhile, the last heirs of a recently usurped dynasty plot to take back their homeland from across the Narrow Sea"
  },
  {
    "heroBanner": "./assets/black.jpg",
    "title": ["Title : Black Myth: Wukong", "Release Date : August 20, 2024","Language: Chinese","Type: Video Game","Runtime : ~","StoryLine : "],
    "titleImage": "./assets/blackt.png",
    "description": "Black Myth: Wukong is an action RPG rooted in Chinese mythology. You shall set out as the Destined One to venture into the challenges and marvels ahead, to uncover the obscured truth beneath.",
    "videoUrl": "https://www.youtube.com/watch?v=5ilDoimm15o",
    "moreInfo":" Black Myth: Wukong is an action RPG rooted in Chinese mythology. You shall set out as the Destined One to venture into the challenges and marvels ahead, to uncover the obscured truth beneath the veil of a glorious legend from the past."
  }
  
]